# IdeaStatiCa.ConnectionApi.Model.ConBoltGridOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ConnectedItems** | **List&lt;ConConnectedItem&gt;** |  | [optional]
**BoltAssemblyId** | **int?** |  | [optional]
**BoltShearForceTransfer** | **ConBoltShearTransfer** |  | [optional]
**IsExploded** | **bool** |  | [optional]
**Geometry** | **ConGridGeometry** |  | [optional]
**DefinedBy** | **ConDefinedBy** |  | [optional]
**CoordinateSystem** | **ConLocalCoordinateSystem** |  | [optional]
**SlottedHoles** | **List&lt;ConSlottedHole&gt;** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)